TexasInstruments/mspm0-sdk/examples/nortos/LP_MSPM0C1104/driverlib/empty_driverlib_src/ti/driverlib/dl_mcan.h
    /*! MCAN Control Configuration */
    uint32_t ctrlConf;

    /*! MCAN Nominal Bit Time Configuration */
    uint32_t nomBitTimeConf;

    /*! MCAN Data Bit Time Configuration */
    uint32_t dataBitTimeConf;

    /*! MCAN Timestamp Configuration */
    uint32_t timeCntConf;

    /*! MCAN Timestamp Counter Value */
    uint32_t timeCntVal;

    /*! MCAN Time-out Configuration */
    uint32_t timeOutConf;

    /*! MCAN Time-out Counter Value */
    uint32_t timeOutCntVal;

    /*! MCAN Transmitter Delay Compensation */
    uint32_t txDelCompConf;

    /*! MCAN Interrupt Configuration */
    uint32_t intEnConf;

    /*! MCAN Interrupt Line Select */
    uint32_t intLnSelConf;

    /*! MCAN Interrupt Line Enable */
    uint32_t intLnEnableConf;

    /*! MCAN Global Filter Configuration */
    uint32_t globFiltIDConf;

    /*! MCAN Standard ID Filter Configuration */
    uint32_t stdFiltIDConf;

    /*! MCAN Extended ID Filter Configuration */
    uint32_t exFiltIDConf;

    /*! MCAN Extended ID and Mask */
    uint32_t exFiltIDMsk;

    /*! MCAN Rx FIFO 0 Configuration */
    uint32_t rxFIFO0Conf;

    /*! MCAN Rx Buffer Configuration */
    uint32_t rxBuffConf;

    /*! MCAN Rx FIFO 1 Configuration */
    uint32_t rxFIFO1Conf;

    /*! MCAN Rx Element Size for Rx Buff and FIFOs */
    uint32_t rxDataSize;

    /*! MCAN Tx Buffer Configuration */
    uint32_t txBuffConf;

    /*! MCAN Tx Element Size for Tx Buff*/
    uint32_t txDataSize;

    /*! MCAN Tx Buffer Transmission Interrupt Enable Configuration */
    uint32_t txBuffTxIntConf;

    /*! MCAN Tx Buffer Cancellation Finished Interrupt Enable */
    uint32_t txBuffCancIntConf;

    /*! MCAN Tx Event FIFO Configuration */
    uint32_t txEvntFIFOConf;

    /*! MCAN Subsystem Control Configuration */
    uint32_t ssCtrlConf;

    /*! MCAN Subsystem Interrupt Enable Configuration */
    uint32_t ssIntEnConf;

    /*! MCAN Subsystem External Timestamp Prescaler 0 */
    uint32_t preSclConf;

    /*! MCAN Error detection and correction vector */
    uint32_t edcVecConf;

    /*! MCAN Error detection and correction control Configuration 2 */
    uint32_t edcConf2;

    /*! MCAN Error detection and correction control Configuration 1 */
    uint32_t edcConf1;

    /*! MCAN Error detection and correction control Configuration 0 */
    uint32_t edcConf0;

    /*! MCAN Interrupt Configuration */
    uint32_t intEvnt0Conf;

    /*! MCAN Watchdog Configuration */
    uint32_t ramWDConf;

    /*! MCAN Test Configuration */
    uint32_t testConf;

    /*! Boolean flag indicating whether or not a valid configuration structure
     *  exists. Should not be modified by the user. */
    bool backupRdy;
} DL_MCAN_backupConfig;

/*! @enum DL_MCAN_CLOCK_DIVIDE */
typedef enum {
    /*! Divide MCAN clock by 1 */
    DL_MCAN_CLOCK_DIVIDE_1 = MCAN_CLKDIV_RATIO_DIV_BY_1_,
    /*! Divide MCAN clock by 2 */
    DL_MCAN_CLOCK_DIVIDE_2 = MCAN_CLKDIV_RATIO_DIV_BY_2_,
    /*! Divide MCAN clock by 4 */
    DL_MCAN_CLOCK_DIVIDE_4 = MCAN_CLKDIV_RATIO_DIV_BY_4_
} DL_MCAN_CLOCK_DIVIDE;

/*! @enum DL_MCAN_IIDX */
typedef enum {
    /*! Interrupt index for MCAN clock stop wake up interrupt pending. */
    DL_MCAN_IIDX_WAKEUP = MCAN_IIDX_STAT_WAKEUP,
    /*! Interrupt index for MCAN external timestamp counter overflow interrupt
     *  pending. */
    DL_MCAN_IIDX_TIMESTAMP_OVERFLOW = MCAN_IIDX_STAT_EXT_TS_CNTR_OVFL,
    /*! Interrupt index for MCAN message RAM double error detection interrupt
     *  pending. */
    DL_MCAN_IIDX_DOUBLE_ERROR_DETECTION = MCAN_IIDX_STAT_DED,
    /*! Interrupt index for MCAN message RAM single error correction interrupt
     *  pending. */
    DL_MCAN_IIDX_SINGLE_ERROR_CORRECTION = MCAN_IIDX_STAT_SEC,
    /*! Interrupt index for MCAN interrupt line 1 interrupt pending. */
    DL_MCAN_IIDX_LINE1 = MCAN_IIDX_STAT_INTL1,
    /*! Interrupt index for MCAN interrupt line 0 interrupt pending. */
    DL_MCAN_IIDX_LINE0 = MCAN_IIDX_STAT_INTL0
} DL_MCAN_IIDX;

/**
 *  @brief if MCAN instance is ready to be configured
 *
 *  @param[in] instance      Specifies the CANFD instance. One of
 *                           @ref DL_MCAN_INSTANCE
 *
 *  @return true if MCAN instance is ready to configured
 *  @return false if MCAN instance clock synchronization is ongoing.
 */
bool DL_MCAN_isReady(DL_MCAN_INSTANCE instance);

/**
 *  @brief      Configure CANCLK source clock
 *  @param[in]  mcan        Pointer to the register overlay for the
 *                             peripheral
 *  @param[in]  config         Pointer to the clock configuration struct
 *                             @ref DL_MCAN_ClockConfig.
 */
void DL_MCAN_setClockConfig(MCAN_Regs *mcan, DL_MCAN_ClockConfig *config);

/**
 *  @brief     Get  CANCLK clock configuration
 *  @param[in]  mcan        Pointer to the register overlay for the
 *                             peripheral
 *  @param[in]  config         Pointer to the clock configuration struct
 *                             @ref DL_MCAN_ClockConfig.
 */
void DL_MCAN_getClockConfig(MCAN_Regs *mcan, DL_MCAN_ClockConfig *config);
/**
 *  @brief   This function checks if the MCAN module is in Reset.
 *
 *  @param[in]  mcan  Pointer to the register overlay for the peripheral
 *
 * @retval  state     Returns TRUE if reset is in progress.
 *                    Else returns FALSE.
 */
bool DL_MCAN_isInReset(MCAN_Regs *mcan);

/**
 *  @brief   This API will return flexible data rate operation status
 *          MCAN module.
 *
 *  @param[in]  mcan  Pointer to the register overlay for the peripheral
 *
 * @return  state     Returns TRUE if flexible data rate operation
 *                    is enabled. Else returns FALSE.
 */
bool DL_MCAN_isFDOpEnable(MCAN_Regs *mcan);

/**
 *  @brief   This function checks if the memory initialization is done for
 *          MCAN module.
 *
 *  @param[in]  mcan  Pointer to the register overlay for the peripheral
 *
 *  @retval  state    Returns TRUE if memory initialization is done.
 *                    Else returns FALSE.
 */
bool DL_MCAN_isMemInitDone(MCAN_Regs *mcan);

/**
 *  @brief  This API will set MCAN module mode of operation.
 *
 *  @param[in]  mcan  Pointer to the register overlay for the peripheral
 *  @param[in]  mode  Mode of operation. One of @ref DL_MCAN_OPERATION_MODE.
 *
 *  @return  None.
 */
void DL_MCAN_setOpMode(MCAN_Regs *mcan, uint32_t mode);

/**
 *  @brief            This API will return MCAN module mode of operation.
 *
 *  @param[in]  mcan  Pointer to the register overlay for the peripheral
 *
 *  @return  mode     Mode of operation. One of @ref DL_MCAN_OPERATION_MODE.
 */
uint32_t DL_MCAN_getOpMode(MCAN_Regs *mcan);

/**
 *  @brief   This API will initialize MCAN module.
 *
 *  @param[in]  mcan          Pointer to the register overlay for the peripheral
 *  @param[in]  initParams    Initialization parameters.
 *                            @ref DL_MCAN_InitParams.
 *
 *  @return  status           Initialization status.
 */
int32_t DL_MCAN_init(MCAN_Regs *mcan, const DL_MCAN_InitParams *initParams);

/**
 *  @brief   This API will configure MCAN module.
 *
 *  @param[in]  mcan          Pointer to the register overlay for the peripheral
 *  @param[in]  configParams  Configuration parameters.
 *                            @ref DL_MCAN_ConfigParams.
 *
 *  @return  status          Configuration status.
 */
int32_t DL_MCAN_config(
    MCAN_Regs *mcan, const DL_MCAN_ConfigParams *configParams);

/**
 *  @brief   This API will enable/disable ECC on the Message RAM.
 *
 *  @param[in]  mcan         Pointer to the register overlay for the peripheral
 *  @param[in]  configParams MCAN ECC Configuration Parameters.
 *                           @ref DL_MCAN_ECCConfigParams.
 *
 *  @return  None.
 */
void DL_MCAN_eccConfig(
    MCAN_Regs *mcan, const DL_MCAN_ECCConfigParams *configParams);

/**
 *  @brief   This API will configure a bit timings for MCAN module.
 *
 *  @param[in]  mcan         Pointer to the register overlay for the peripheral
 *  @param[in]  configParams Configuration parameters for MCAN bit timing.
 *                           @ref DL_MCAN_BitTimingParams.
 *
 *  @return  status          Bit Timings configuration status.
 */
int32_t DL_MCAN_setBitTime(
    MCAN_Regs *mcan, const DL_MCAN_BitTimingParams *configParams);

/**
 *  @brief   This API will configure Different sections of Message RAM.
 *
 *  @param[in]  mcan        Pointer to the register overlay for the peripheral
 *  @param[in]  msgRAMConfigParams
 *                          Message RAM Configuration parameters.
 *                          @ref DL_MCAN_MsgRAMConfigParams.
 *
 *  @return  status          Configuration Status.
 */
int32_t DL_MCAN_msgRAMConfig(
    MCAN_Regs *mcan, const DL_MCAN_MsgRAMConfigParams *msgRAMConfigParams);

/**
 *  @brief   This API will configure Extended ID AND Mask.
 *
 *  @param[in]  mcan      Pointer to the register overlay for the peripheral
 *  @param[in]  idMask    Configuration parameters for MCAN Extended Id mask.
 *                        This value is 29 bit wide.
 *
 *  @return  status       Extended ID AND Mask configuration status.
 */
int32_t DL_MCAN_setExtIDAndMask(MCAN_Regs *mcan, uint32_t idMask);

/**
 *  @brief   This API is used to write Tx message to message RAM.
 *
 *  @param[in]  mcan       Pointer to the register overlay for the peripheral
 *  @param[in]  memType    Part of message ram to which given message to write.
 *                         One of @ref DL_MCAN_MEM_TYPE.
 *  @param[in]  bufNum     Buffer  number where message to write.
 *                         This parameter will ignored if memType is FIFO/Q.
 *  @param[in]  elem       Message Object.
 *                         @ref DL_MCAN_TxBufElement.
 *
 *  @return  None.
 */
void DL_MCAN_writeMsgRam(MCAN_Regs *mcan, uint32_t memType, uint32_t bufNum,
    const DL_MCAN_TxBufElement *elem);

/**
 *  @brief   This API will set Tx Buffer Add Request.
 *
 *  @param[in]  mcan    Pointer to the register overlay for the peripheral
 *  @param[in]  bufNum  Tx Buffer number for which request is to be added.
 *
 *  @return  status     Configuration Status.
 */
int32_t DL_MCAN_TXBufAddReq(MCAN_Regs *mcan, uint32_t bufNum);

/**
 *  @brief   This API will return New Data Message Status.
 *
 *  @param[in]  mcan          Pointer to the register overlay for the peripheral
 *  @param[in]  newDataStatus Rx Buffer new data status.
 *                            @ref DL_MCAN_RxNewDataStatus.
 *
 *  @return  None.
 */
void DL_MCAN_getNewDataStatus(
    MCAN_Regs *mcan, DL_MCAN_RxNewDataStatus *newDataStatus);

/**
 *  @brief   This API clear New Data Message Status.
 *
 *  @param[in]  mcan          Pointer to the register overlay for the peripheral
 *  @param[in]  newDataStatus Rx Buffer new data status.
 *                            @ref DL_MCAN_RxNewDataStatus.
 *
 *  @return  None.
 */
void DL_MCAN_clearNewDataStatus(
    MCAN_Regs *mcan, const DL_MCAN_RxNewDataStatus *newDataStatus);

/**
 *  @brief   This API is used to read received message form message RAM.
 *
 *  @param[in]  mcan        Pointer to the register overlay for the peripheral
 *  @param[in]  memType     Part of message ram to which given message to
 *                          write.One of @ref DL_MCAN_MEM_TYPE.
 *  @param[in]  bufNum      Buffer  number from where message is to read.
 *                          This parameter will ignored if memType is FIFO/Q.
 *  @param[in]  fifoNum     FIFOs number from where message is to read.
 *                          One of @ref DL_MCAN_RX_FIFO_NUM.
 *                          This parameter will ignored if memType is buffer.
 *  @param[in]  elem        Message Object.
 *                          @ref DL_MCAN_RxBufElement.
 *
 *  @return  None.
 */
void DL_MCAN_readMsgRam(MCAN_Regs *mcan, uint32_t memType, uint32_t bufNum,
    uint32_t fifoNum, DL_MCAN_RxBufElement *elem);

/**
 *  @brief   This API is used to read message form Tx Event FIFO.
 *
 *  @param[in]  mcan         Pointer to the register overlay for the peripheral
 *  @param[in]  txEventElem  Tx Event FIFO Message Object.
 *                           @ref DL_MCAN_TxEventFIFOElement.
 *
 *  @return  None.
 */
void DL_MCAN_readTxEventFIFO(
    MCAN_Regs *mcan, DL_MCAN_TxEventFIFOElement *txEventElem);

/**
 *  @brief   This API is used to add Standard Message ID Filter Element.
 *
 *  @note MCAN RAM must be configured @ref DL_MCAN_msgRAMConfig before
 *  calling this API.
 *
 *  @param[in]  mcan       Pointer to the register overlay for the peripheral
 *  @param[in]  filtNum    Filter number.
 *  @param[in]  elem       Filter Object. @ref DL_MCAN_StdMsgIDFilterElement.
 *
 *  @return  None.
 *
 *  @sa DL_MCAN_msgRAMConfig
 */
void DL_MCAN_addStdMsgIDFilter(MCAN_Regs *mcan, uint32_t filtNum,
    const DL_MCAN_StdMsgIDFilterElement *elem);

/**
 *  @brief   This API is used to add Extended Message ID Filter Element.
 *
 *  @note MCAN RAM must be configured @ref DL_MCAN_msgRAMConfig before
 *  calling this API.
 *
 *  @param[in]  mcan     Pointer to the register overlay for the peripheral
 *  @param[in]  filtNum  Filter  number.
 *  @param[in]  elem     Filter Object. @ref DL_MCAN_ExtMsgIDFilterElement.
 *
 *  @return  None.
 *
 *  @sa DL_MCAN_msgRAMConfig
 */
void DL_MCAN_addExtMsgIDFilter(MCAN_Regs *mcan, uint32_t filtNum,
    const DL_MCAN_ExtMsgIDFilterElement *elem);

/**
 *  @brief   This API will enable/disable Loop Back Test Mode for
 *           MCAN module.
 *
 *  @param[in]  mcan      Pointer to the register overlay for the peripheral
 *  @param[in]  lpbkMode  Loopback mode for MCAN.
 *                        One of @ref DL_MCAN_LPBK_MODE.
 *  @param[in]  enable    Loop Back Mode is enabled if it is TRUE.
 *                        Loop Back Mode is disabled if it is FALSE.
 *
 *  @return  None.
 * \note    This API can be called only when MCAN is in Software
 *          Initialization mode of operation.
 */
void DL_MCAN_lpbkModeEnable(MCAN_Regs *mcan, uint32_t lpbkMode, bool enable);

/**
 *  @brief   This API will return error counter status for MCAN module.
 *
 *  @param[in]  mcan       Pointer to the register overlay for the peripheral
 *  @param[in]  errCounter Error Counter Status. @ref DL_MCAN_ErrCntStatus.
 *
 *  @return  None.
 */
void DL_MCAN_getErrCounters(MCAN_Regs *mcan, DL_MCAN_ErrCntStatus *errCounter);

/**
 *  @brief   This API will return protocol status for MCAN module.
 *
 *  @param[in]  mcan        Pointer to the register overlay for the peripheral
 *  @param[in]  protStatus  Protocol Status. @ref DL_MCAN_ProtocolStatus.
 *
 *  @return  None.
 */
void DL_MCAN_getProtocolStatus(
    MCAN_Regs *mcan, DL_MCAN_ProtocolStatus *protStatus);

/**
 *  @brief   This API is used to enable/disable interrupts.
 *
 *  @param[in]  mcan      Pointer to the register overlay for the peripheral
 *  @param[in]  intrMask  Interrupts to enable. One of @ref DL_MCAN_INTR_SRC.
 *  @param[in]  enable    Interrupt is enabled if it is TRUE.
 *                        Interrupt is disabled if it is FALSE.
 *
 *  @return  None.
 */
void DL_MCAN_enableIntr(MCAN_Regs *mcan, uint32_t intrMask, bool enable);

/**
 *  @brief   This API is used to select interrupt line.
 *
 *  @param[in]  mcan      Pointer to the register overlay for the peripheral
 *  @param[in]  intrMask  Interrupt Number for which interrupt
 *                        line is to be selected. One of @ref DL_MCAN_INTR_SRC.
 *  @param[in]  lineNum   Interrupt Line to select.
 *                        One of @ref DL_MCAN_INTR_LINE_NUM,
 *
 *  @return  None.
 */
void DL_MCAN_selectIntrLine(
    MCAN_Regs *mcan, uint32_t intrMask, uint32_t lineNum);

/**
 *  @brief   This API is used to get interrupt line selected for each interrupt.
 *
 *  @param[in]  mcan  Pointer to the register overlay for the peripheral
 *
 *  @return  status   Interrupt Line Select Status.
 */
uint32_t DL_MCAN_getIntrLineSelectStatus(MCAN_Regs *mcan);

/**
 *  @brief   This API is used to enable/disable selected interrupt line.
 *
 *  @param[in]  mcan      Pointer to the register overlay for the peripheral
 *  @param[in]  lineNum   Interrupt Line to select.
 *                        One of @ref DL_MCAN_INTR_LINE_NUM,
 *  @param[in]  enable    Interrupt Line is enabled if it is TRUE.
 *                        Interrupt Line is disabled if it is FALSE.
 *
 *  @return  None.
 */
void DL_MCAN_enableIntrLine(MCAN_Regs *mcan, uint32_t lineNum, bool enable);

/**
 *  @brief   This API will return interrupt status.
 *
 *  @param[in]  mcan  Pointer to the register overlay for the peripheral
 *
 *  @return  status   Interrupt Status.
 */
uint32_t DL_MCAN_getIntrStatus(MCAN_Regs *mcan);

/**
 *  @brief   This API is used to clear the interrupt status.
 *
 *  @param[in]  mcan       Pointer to the register overlay for the peripheral
 *  @param[in]  intrMask   Interrupts to clear status.
 *  @param[in]  eoi        Specified the associated. @ref DL_MCAN_INTR_SRC
 *
 *  @return  None.
 */
void DL_MCAN_clearIntrStatus(
    MCAN_Regs *mcan, uint32_t intrMask, DL_MCAN_INTR_SRC_MCAN eoi);

/**
 *  @brief   This API will return High Priority Message Status.
 *
 *  @param[in]  mcan  Pointer to the register overlay for the peripheral
 *  @param[in]  hpm   High Priority Message Status.
 *                    @ref DL_MCAN_HighPriorityMsgInfo.
 *
 *  @return  None.
 */
void DL_MCAN_getHighPriorityMsgStatus(
    MCAN_Regs *mcan, DL_MCAN_HighPriorityMsgInfo *hpm);

/**
 *  @brief   This API will Rx FIFO status.
 *
 *  @param[in]  mcan       Pointer to the register overlay for the peripheral
 *  @param[in]  fifoStatus Rx FIFO Status. @ref DL_MCAN_RxFIFOStatus.
 *
 *  @return  None.
 */
void DL_MCAN_getRxFIFOStatus(
    MCAN_Regs *mcan, DL_MCAN_RxFIFOStatus *fifoStatus);

/**
 *  @brief   This API will write Rx FIFO Acknowledgement.
 *
 *  @param[in]  mcan     Pointer to the register overlay for the peripheral
 *  @param[in]  fifoNum  FIFO Number. One of @ref DL_MCAN_RX_FIFO_NUM.
 *  @param[in]  idx      Rx FIFO Acknowledge Index
 *
 *  @return  status      Acknowledgement Status.
 */
int32_t DL_MCAN_writeRxFIFOAck(
    MCAN_Regs *mcan, uint32_t fifoNum, uint32_t idx);

/**
 *  @brief   This API will Tx FIFO status.
 *
 *  @param[in]  mcan        Pointer to the register overlay for the peripheral
 *  @param[in]  fifoStatus  Tx FIFO Status. @ref DL_MCAN_TxFIFOStatus.
 *
 *  @return  None.
 */
void DL_MCAN_getTxFIFOQueStatus(
    MCAN_Regs *mcan, DL_MCAN_TxFIFOStatus *fifoStatus);

/**
 *  @brief   This API will return Tx Buffer Request Pending status.
 *
 *  @param[in]  mcan  Pointer to the register overlay for the peripheral
 *
 *  @return  status   Tx Buffer Request Pending status.
 */
uint32_t DL_MCAN_getTxBufReqPend(MCAN_Regs *mcan);

/**
 *  @brief   This API will set Tx Buffer Cancellation Request.
 *
 *  @param[in]  mcan      Pointer to the register overlay for the peripheral
 *  @param[in]  buffNum   Tx Buffer number for which request is to be added.
 *
 *  @return  status       Configuration Status.
 */
int32_t DL_MCAN_txBufCancellationReq(MCAN_Regs *mcan, uint32_t buffNum);

/**
 *  @brief   This API will return Tx Buffer Transmission Occurred status.
 *
 *  @param[in]  mcan  Pointer to the register overlay for the peripheral
 *
 *  @return  status   Tx Buffer Transmission Occurred status.
 */
uint32_t DL_MCAN_getTxBufTransmissionStatus(MCAN_Regs *mcan);

/**
 *  @brief   This API will return Transmit Buffer Cancellation Finished status.
 *
 *  @param[in]  mcan  Pointer to the register overlay for the peripheral
 *
 *  @return  status   Transmit Buffer Cancellation Finished status.
 */
uint32_t DL_MCAN_txBufCancellationStatus(MCAN_Regs *mcan);

/**
 *  @brief   This API is used to enable/disable Tx Buffer Transmission Interrupt.
 *
 *  @param[in]  mcan    Pointer to the register overlay for the peripheral
 *  @param[in]  bufNum  Buffer number for which interrupt is to enable.
 *  @param[in]  enable  Interrupt is enabled if it is TRUE.
 *                      Interrupt is disabled if it is FALSE.
 *
 *  @return  status     Configuration status.
 */
int32_t DL_MCAN_TXBufTransIntrEnable(
    MCAN_Regs *mcan, uint32_t bufNum, bool enable);

/**
 *  @brief   This API is used to enable/disable Tx Buffer Cancellation Finished
 *          Interrupt.
 *
 *  @param[in]  mcan     Pointer to the register overlay for the peripheral
 *  @param[in]  bufNum   Buffer number for which interrupt is to enable.
 *  @param[in]  enable   Interrupt is enabled if it is TRUE.
 *                       Interrupt is disabled if it is FALSE.
 *
 *  @return  status          Configuration status.
 */
int32_t DL_MCAN_getTxBufCancellationIntrEnable(
    MCAN_Regs *mcan, uint32_t bufNum, bool enable);

/**
 *  @brief   This API add clock stop request for MCAN module to put it in
 *          power down mode.
 *
 *  @param[in]  mcan    Pointer to the register overlay for the peripheral
 *  @param[in]  enable  Add Clock Stop Request.
 *                      Adds Clock Stop Request is TRUE otherwise
 *                      removes it.
 *
 *  @return  None.
 */
void DL_MCAN_addClockStopRequest(MCAN_Regs *mcan, bool enable);

/**
 *  @brief   This API will Tx Event FIFO status.
 *
 *  @param[in]  mcan        Pointer to the register overlay for the peripheral
 *  @param[in]  fifoStatus  Tx Event FIFO Status.
 *                          @ref DL_MCAN_TxEventFIFOStatus.
 *
 *  @return  None.
 */
void DL_MCAN_getTxEventFIFOStatus(
    MCAN_Regs *mcan, DL_MCAN_TxEventFIFOStatus *fifoStatus);

/**
 *  @brief   This API will write Event FIFO Acknowledge Index.
 *
 *  @param[in]  mcan  Pointer to the register overlay for the peripheral
 *  @param[in]  idx   Event FIFO Acknowledge Index
 *
 *  @return  status   Acknowledgement Status.
 */
int32_t DL_MCAN_writeTxEventFIFOAck(MCAN_Regs *mcan, uint32_t idx);

/**
 *  @brief   This API will Force Error on ECC.
 *
 *  @param[in]  mcan    Pointer to the register overlay for the peripheral
 *  @param[in]  eccErr  Force Error on ECC configuration.
 *                      @ref DL_MCAN_ECCErrForceParams.
 *
 *  @return  status     Configuration status.
 */
void DL_MCAN_eccForceError(
    MCAN_Regs *mcan, const DL_MCAN_ECCErrForceParams *eccErr);

/**
 *  @brief   This API will return ECC Error status.
 *
 *  @param[in]  mcan    Pointer to the register overlay for the peripheral
 *  @param[in]  eccErr  ECC error status. @ref DL_MCAN_ECCErrStatus.
 *
 *  @return  None.
 */
void DL_MCAN_eccGetErrorStatus(MCAN_Regs *mcan, DL_MCAN_ECCErrStatus *eccErr);

/**
 *  @brief   This API is used to clear the ECC Error status.
 *
 *  @param[in]  mcan     Pointer to the register overlay for the peripheral
 *  @param[in]  errType  Error type to clear status.
 *                       One of @ref DL_MCAN_ECC_ERR_TYPE.
 *
 *  @return  None.
 */
void DL_MCAN_eccClearErrorStatus(MCAN_Regs *mcan, uint32_t errType);

/**
 *  @brief   This API is used to write End of Interrupt for ECC interrupt.
 *
 *  @param[in]  mcan      Pointer to the register overlay for the peripheral
 *  @param[in]  errType   Interrupt to enable. One of @ref DL_MCAN_ECC_ERR_TYPE.
 *
 *  @return  None.
 */
void DL_MCAN_eccWriteEOI(MCAN_Regs *mcan, uint32_t errType);

/**
 *  @brief   This API is used to enable ECC interrupt.
 *
 *  @param[in]  mcan    Pointer to the register overlay for the peripheral
 *  @param[in]  errType Interrupt to enable. One of @ref DL_MCAN_ECC_ERR_TYPE.
 *  @param[in]  enable  ECC Interrupt is enabled if it is TRUE.
 *                      ECC Interrupt is disabled if it is FALSE.
 *
 *  @return  None.
 */
void DL_MCAN_eccEnableIntr(MCAN_Regs *mcan, uint32_t errType, bool enable);

/**
 *  @brief   This API is used to get ECC interrupt status.
 *
 *  @param[in]  mcan     Pointer to the register overlay for the peripheral
 *  @param[in]  errType  Interrupt status to read.
 *                       One of @ref DL_MCAN_ECC_ERR_TYPE.
 *
 *  @return  None.
 */
uint32_t DL_MCAN_eccGetIntrStatus(MCAN_Regs *mcan, uint32_t errType);

